org/resources.org
#+HTML: <h1>Ресурсы</h1>
#+HTML: <order>5</order>

* Электронные книги

** Lisp

   - [[./pcl.pdf][Practical Common Lisp. Peter Siebel (Перевод сообщества)]]
   - [[./sicp.pdf][Структура и интерпретация компьютерных программ. Абельсон, Сассман (перевод: Ю. Бронников)]]
   - [[./lisp1.pdf][Мир Лиспа. Том 1. Э.Хювенен, И.Сеппянен]]
   - [[./lisp2.pdf][Мир Лиспа. Том 2. Э.Хювенен, И.Сеппянен]]
   - [[./lisp_intro.pdf][Введение в программирование на языке Лисп. Лидия Городняя]]

** Emacs

   - [[./emacs-man.pdf][Руководство по GNU Emacs]]
   - [[./emacs-lisp-man.pdf][Программирование на Emacs Lisp]]

** Прочее

   - [[./tapl.pdf][Типы в языках программирования]]
   - [[./compilers.djvu][Компиляторы (Книга Дракона). Ахо, Лам, Сети, Ульман]]
   - [[./cormen.pdf][Алгоритмы. Построение и анализ. Т. Кормен, Ч. Лейзерсон, Р. Ривест, К. Штайн]]
