public_html/resources.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Электронные книги</a>
<ul>
<li><a href="#unnumbered-2">Lisp</a></li>
<li><a href="#unnumbered-3">Emacs</a></li>
<li><a href="#unnumbered-4">Прочее</a></li>
</ul>
</li>
</ul>
</div>
</div>
<h1>Ресурсы</h1>
<order>5</order>

<heading id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Электронные книги</h2>
<div class="outline-text-2" id="text-unnumbered-1">
</div><div id="outline-container-unnumbered-2" class="outline-3">
<h3 id="unnumbered-2">Lisp</h3>
<div class="outline-text-3" id="text-unnumbered-2">
<ul class="org-ul">
<li><a href="./pcl.pdf">Practical Common Lisp. Peter Siebel (Перевод сообщества)</a>
</li>
<li><a href="./sicp.pdf">Структура и интерпретация компьютерных программ. Абельсон, Сассман (перевод: Ю. Бронников)</a>
</li>
<li><a href="./lisp1.pdf">Мир Лиспа. Том 1. Э.Хювенен, И.Сеппянен</a>
</li>
<li><a href="./lisp2.pdf">Мир Лиспа. Том 2. Э.Хювенен, И.Сеппянен</a>
</li>
<li><a href="./lisp_intro.pdf">Введение в программирование на языке Лисп. Лидия Городняя</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-3">
<h3 id="unnumbered-3">Emacs</h3>
<div class="outline-text-3" id="text-unnumbered-3">
<ul class="org-ul">
<li><a href="./emacs-man.pdf">Руководство по GNU Emacs</a>
</li>
<li><a href="./emacs-lisp-man.pdf">Программирование на Emacs Lisp</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-3">
<h3 id="unnumbered-4">Прочее</h3>
<div class="outline-text-3" id="text-unnumbered-4">
<ul class="org-ul">
<li><a href="./tapl.pdf">Типы в языках программирования</a>
</li>
<li><a href="./compilers.djvu">Компиляторы (Книга Дракона). Ахо, Лам, Сети, Ульман</a>
</li>
<li><a href="./cormen.pdf">Алгоритмы. Построение и анализ. Т. Кормен, Ч. Лейзерсон, Р. Ривест, К. Штайн</a>
</li>
</ul>
</div>
</div>
</heading>
